# https://github.com/Homebrew/homebrew-bundle

tap "caskroom/cask-cask"
tap "caskroom/cask-versions"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "thoughtbot/formulae"
tap "universal-ctags/universal-ctags"
tap "caskroom/fonts"

# Homebrew
# https://github.com/Homebrew/brew/

# Need to install openssl before libyaml
brew "openssl"
brew "openssl@1.1" # wget dependency

brew "ansible"
brew "autoconf" # asdf dependency
brew "automake" # asdf dependency
brew "awscli"
brew "bash"
brew "bash-completion"
brew "cmake"
brew "coreutils"
brew "diff-so-fancy"
brew "dockutil"
brew "git"
brew "git-extras"
brew "git-quick-stats"
brew "gpg" # asdf-nodejs dependency
brew "htop"
brew "httpie"
brew "antigen"
brew "imagemagick"
brew "libtool" # asdf dependency
brew "libxslt" # asdf dependency
brew "libyaml" # asdf dependency
brew "mas"
brew "mysql"
brew "overmind"
brew "percona-toolkit"
brew "pgcli"
brew "postgresql", restart_service: true
brew "readline"
brew "reattach-to-user-namespace"
brew "redis"
brew "rsync"
brew "shellcheck"
brew "sqlite"
brew "ssh-copy-id"
brew "tmux"
brew "tree"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "unixodbc" # asdf dependency
brew "wget"
brew "yarn", args: ["without-node"]
brew "zsh"
brew "flux"

# homebrew-cask
# https://github.com/caskroom/homebrew-cask
cask "alfred"
cask "appdelete"
cask "boom-3d"
cask "day-o"
cask "dash"
cask "dropbox"
cask "google-chrome"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "kindle"
cask "psequel"
cask "rescuetime"
cask "slack"
cask "font-firacode-nerd-font-mono"
cask "font-firacode-nerd-font"
cask "alfred"
cask "visual-studio-code"
cask "bartender"
cask "carbon-copy-cloner"
cask "caskroom/versions/vmware-fusion8"
cask "cleanmymac"
cask "google-chrome"
cask "iterm2"
cask "postman"
cask "the-unarchiver"
cask "vagrant"

mas "1Password", id: 443987910
mas "Magnet", id: 441258766
mas "DaisyDisk", id: 411643860
mas "Monosnap", id: 540348655
mas "Things 3", id: 904280696
